app/controllers/alumnos_controller.rb

  def index
    @alumnos = Alumno.all
---
SELECT "alumnos".* FROM "alumnos"

  def create
    @alumno = Alumno.new(alumno_params)

    respond_to do |format|
      if @alumno.save
---
INSERT INTO "alumnos" ("nombre", "apellido", "cedula", "correo", "telefono", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @alumno.update(alumno_params)
---
UPDATE "alumnos" SET "telefono" = ?, "updated_at" = ? WHERE "alumnos"."id" = ?  [["telefono", "02747789546"], ["updated_at", "2016-03-03 15:17:46.326940"], ["id", 2]]

    def set_alumno
      @alumno = Alumno.find(params[:id])
---
SELECT  "alumnos".* FROM "alumnos" WHERE "alumnos"."id" = ? LIMIT 1  [["id", 2]]